mooc-ui/SDK15.3-test-in-NRF52840-/examples/ble_peripheral/ble_app_hrs/main.c
    err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    ret_code_t err_code;

    err_code = nrf_ble_lesc_request_handler();
    APP_ERROR_CHECK(err_code);

    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}

static void hardware_init(void){
    /*里面应该包含各种外部硬件设备的状态
    例如电池的状态、传感器的状态、整个设备所处在状态*/
}

static void add_loop_func(uint16_t opera_id, userDefFunc udf){
    if(opera_id != 0 && udf != NULL){
        if(opera_id <= MAX_OPERA_NUM){
            lpcb[opera_id-1].event = opera_id;
            lpcb[opera_id-1].func = udf;
        }
    }
}

static void sensor1_task(void *p_context){
    NRF_LOG_INFO("I'am sensor1 process");
}

static void RadioLink_TxTask(void *p_context){
    NRF_LOG_INFO("I'am radio tx task process");
}

static void RadioLink_RxTask(void *p_context){
    NRF_LOG_INFO("I'am radio rx task process");
}
static void flash_read_write_task(void *p_context){
    /*
    switch(type){
        case read:
            break;
        case write:
            break;
        default:
            break;
    }
    */
}
static void sensor_data_process_task(void *p_context){
    //
}

static void power_management_task(void *p_context){
    //
}

static void system_task(void *p_context){
    uint8_t data_len = 20;
    uint8_t data[20] = {0};
    memset(data,get_time()%255,20);
    eeg_notify(data, data_len);
    eeg_indicate(data, data_len);
    //NRF_LOG_INFO("I'am system event process");
}

static void task_body(void){
    add_loop_func(SENSOR_OP, sensor1_task);
    add_loop_func(RADIO_TX_OP, RadioLink_TxTask);
    add_loop_func(RADIO_RX_OP, RadioLink_RxTask);
    add_loop_func(FLASH_WRITE_READ_OP, flash_read_write_task);
    add_loop_func(SENSOR_DATA_PROCESS_OP, sensor_data_process_task);
    add_loop_func(POWER_MANAGEMENT_OP, power_management_task);
    add_loop_func(SYS_OP, system_task);
}

static void task_init(void){
    mrEvtQueue = mring_queueInit(SYS_EVT_QUEUE);//队列初始化(相当于任务初始化)
    mrAfeQueue = mring_queueInit(AFE_I2C_QUEUE);
	mrAccQueue = mring_queueInit(ACC_I2C_QUEUE);
}

static void consume_task(){
    if(NULL != mrEvtQueue) {
        while(!mring_queueIsEmpty(mrEvtQueue)) {
            stEvtBuffer buffer;
            if(true == mring_queueReceive(mrEvtQueue, (void*)&buffer)) {
                if(buffer.evt != 0) {
                    if (lpcb[buffer.evt-1].func) {
                        lpcb[buffer.evt-1].func(buffer.payload);
                    }
                } 
            }
        }
    }
}

/**@brief Function for application main entry.
 */
int main(void)
{
    bool erase_bonds;
    hardware_init();
    task_init();

    // Initialize.
    log_init();
    timers_init();
    buttons_leds_init(&erase_bonds);
    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    advertising_init();
    services_init();
    sensor_simulator_init();
    conn_params_init();
    peer_manager_init();
    
    rtc2_enable();
    task_body();

    // Start execution.
    NRF_LOG_INFO("Heart Rate Sensor example started.");
    application_timers_start();
    advertising_start(erase_bonds);
    
    // Enter main loop.
    for (;;)
    {
        consume_task();
        idle_state_handle();
    }
}


